app/controllers/comments_controller.rb

  def create
    @post = Post.find(params[:post_id])
    @comment = @post.comments.create(params[:comment])
---
SELECT `posts`.* FROM `posts` WHERE `posts`.`id` = 2 LIMIT 1
INSERT INTO `comments` (`body`, `commenter`, `created_at`, `post_id`, `updated_at`) VALUES ('jj', 'h', '2012-12-30 20:11:46', 2, '2012-12-30 20:11:46')

  def destroy
    @post = Post.find(params[:post_id])
    @comment = @post.comments.find(params[:id])
    @comment.destroy
---
SELECT `posts`.* FROM `posts` WHERE `posts`.`id` = 2 LIMIT 1
SELECT `comments`.* FROM `comments` WHERE `comments`.`post_id` = 2 AND `comments`.`id` = 1 LIMIT 1
DELETE FROM `comments` WHERE `comments`.`id` = 1