app/controllers/posts_controller.rb

  def create
    @post = Post.new(params[:post])

    respond_to do |format|
      if @post.save
---
INSERT INTO `posts` (`address`, `created_at`, `desire`, `dob`, `hobby`, `interest`, `name`, `signature`, `updated_at`) VALUES ('b', '2012-12-30 17:14:44', 'd', '2012-12-30', 'd', 'd', 'a', 'd', '2012-12-30 17:14:44')

  def update
    @post = Post.find(params[:id])
---
SELECT `posts`.* FROM `posts` WHERE `posts`.`id` = 1 LIMIT 1

  def destroy
    @post = Post.find(params[:id])
    @post.destroy
---
SELECT `posts`.* FROM `posts` WHERE `posts`.`id` = 1 LIMIT 1
DELETE FROM `posts` WHERE `posts`.`id` = 1